Repository: SakuzyPeng/HapticGen
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# common.alert.error.title
source: Error
zh_hans: 错误

# common.button.ok
source: OK
zh_hans: 确定

# language.menu.title
source: Language
zh_hans: 语言

# language.option.auto
source: Auto (System)
zh_hans: 跟随系统

# debug.navigation.title
source: AudioHaptic Debug
zh_hans: AudioHaptic 调试

# debug.section.import
source: Import
zh_hans: 导入

# debug.section.action
source: Actions
zh_hans: 操作

# debug.section.parameters
source: Parameters
zh_hans: 参数

# debug.section.result
source: Results
zh_hans: 结果

# debug.section.status
source: Status
zh_hans: 状态

# debug.button.importAudio
source: Import Audio
zh_hans: 导入音频

# debug.button.analyze
source: Analyze
zh_hans: 分析

# debug.button.generate
source: Generate
zh_hans: 生成

# debug.button.play
source: Play
zh_hans: 播放

# debug.button.pause
source: Pause
zh_hans: 暂停

# debug.button.stop
source: Stop
zh_hans: 停止

# debug.button.exportAHAP
source: Export .ahap
zh_hans: 导出 .ahap

# debug.button.packageTrailer
source: Package Haptic Trailer
zh_hans: 打包 Haptic Trailer

# debug.slider.intensityScale
source: Intensity Scale
zh_hans: 强度倍率

# debug.slider.sharpnessBias
source: Sharpness Bias
zh_hans: 清晰度偏移

# debug.slider.eventDensity
source: Event Density
zh_hans: 事件密度

# debug.slider.transientSensitivity
source: Transient Sensitivity
zh_hans: 瞬态灵敏度

# debug.label.file.format
source: File: %@
zh_hans: 文件：%@

# debug.label.channel.format
source: Channels: %d
zh_hans: 声道：%d

# debug.label.duration.format
source: Duration: %@
zh_hans: 时长：%@

# debug.label.analysisFrames.format
source: Analysis Frames: %d
zh_hans: 分析帧数：%d

# debug.label.analysisFrames.empty
source: Analysis Frames: -
zh_hans: 分析帧数：-

# debug.label.layout.format
source: Layout: %dch
zh_hans: 布局：%dch

# debug.label.transientCount.format
source: Transients: %d
zh_hans: 瞬态数量：%d

# debug.label.transientCount.empty
source: Transients: -
zh_hans: 瞬态数量：-

# debug.label.intensityPoints.format
source: Intensity Points: %d
zh_hans: Intensity 点数：%d

# debug.label.sharpnessPoints.format
source: Sharpness Points: %d
zh_hans: Sharpness 点数：%d

# debug.label.curvePoints.empty
source: Curve Points: -
zh_hans: 曲线点数：-

# debug.label.exportPath.format
source: Export Path: %@
zh_hans: 导出路径：%@

# debug.label.strategyRatio.format
source: Strategy K/V/B: %d%% / %d%% / %d%%
zh_hans: 策略占比 K/V/B：%d%% / %d%% / %d%%

# debug.label.lfeAvailable.true
source: LFE available: Yes
zh_hans: LFE 可用：是

# debug.label.lfeAvailable.false
source: LFE available: No
zh_hans: LFE 可用：否

# debug.label.fallback.format
source: Fallback: %@
zh_hans: 回退：%@

# player.section.packageInfo
source: Package Info
zh_hans: 包信息

# player.section.playback
source: Playback Controls
zh_hans: 播放控制

# player.section.export
source: Export
zh_hans: 导出

# player.info.file
source: File
zh_hans: 文件

# player.info.hlsTag
source: HLS Tag
zh_hans: HLS 标签

# player.info.hapticsSupport
source: Haptics Support
zh_hans: 触觉支持

# player.info.hapticsSupported
source: Supported (Device)
zh_hans: 支持（真机）

# player.info.hapticsUnsupported
source: Unsupported (Simulator)
zh_hans: 不支持（模拟器）

# player.loading
source: Loading...
zh_hans: 加载中…

# player.button.share
source: Share Haptic Trailer Package
zh_hans: 分享 Haptic Trailer 包

# player.description.share
source: Zip includes manifest, AHAP, and audio. Open with this app on the receiving device.
zh_hans: zip 包内含清单、AHAP 和音频，接收方用本 App 打开即可播放。

# status.selectAudio
source: Please select an audio file
zh_hans: 请选择音频文件

# status.importReady
source: Audio imported. Tap Analyze to start.
zh_hans: 已导入音频，点击 Analyze 开始分析

# status.analyzing
source: Analyzing...
zh_hans: 分析中...

# status.analysisCompleted.format
source: Analysis complete: %dch, ready to generate
zh_hans: 分析完成：%dch，可继续 Generate

# status.generateCompleted.format
source: Generation complete: %d transient events
zh_hans: 生成完成：%d 个瞬态事件

# status.paused
source: Paused
zh_hans: 已暂停

# status.playing
source: Playing
zh_hans: 播放中

# status.trailerPackaged.format
source: Haptic Trailer packaged: %@
zh_hans: Haptic Trailer 已生成：%@

# status.exportSuccess.format
source: Exported successfully: %@
zh_hans: 导出成功：%@

# status.errorOccurred
source: An error occurred
zh_hans: 发生错误

# error.invalidAudioFormat
source: Unable to parse audio format.
zh_hans: 无法解析音频格式。

# error.unsupportedHaptics
source: Haptics are not supported on this device.
zh_hans: 当前设备不支持触觉功能。

# error.analysisFailed.format
source: Audio analysis failed: %@
zh_hans: 音频分析失败：%@

# error.generationFailed.format
source: Haptic generation failed: %@
zh_hans: 触觉生成失败：%@

# error.exportFailed.format
source: Export failed: %@
zh_hans: 导出失败：%@

# error.playbackFailed.format
source: Playback failed: %@
zh_hans: 播放失败：%@

# error.detail.importAudioFirst
source: Please import audio first
zh_hans: 请先导入音频

# error.detail.completeAnalysisFirst
source: Please complete analysis first
zh_hans: 请先完成分析

# error.detail.generatePatternFirst
source: Please generate a pattern first
zh_hans: 请先生成 pattern

# error.detail.sourceAudioMissing
source: Source audio file is missing
zh_hans: 缺少源音频文件

# error.detail.prepareFirst
source: Please call prepare first
zh_hans: 请先 prepare

# error.detail.patternMissing
source: Missing haptic pattern
zh_hans: 缺少触觉 pattern

# error.detail.hapticPlayerNotPrepared
source: Haptic player is not prepared
zh_hans: 触觉播放器未准备

# error.detail.loadManifestFirst
source: Please load a manifest first
zh_hans: 请先 load 清单

# error.detail.manifestNotFoundInZip
source: No .m3u8 manifest found in zip
zh_hans: zip 包中未找到 .m3u8 清单

# error.detail.manifestMissingAHAPURL
source: Manifest missing AHAP URL
zh_hans: 清单缺少 AHAP URL

# error.detail.manifestMissingAudioURL
source: Manifest missing audio URL
zh_hans: 清单缺少音频 URL

# error.detail.audioBufferCreationFailed
source: Unable to create audio buffer
zh_hans: 无法创建音频 buffer

# error.detail.patternBuildFailed.format
source: Unable to build CHHapticPattern: %@
zh_hans: 无法构建 CHHapticPattern: %@

# error.detail.manifestEncodingFailed
source: Manifest encoding failed
zh_hans: 清单编码失败

# error.detail.emptyAnalysisResult
source: Analysis result is empty
zh_hans: 分析结果为空

# error.detail.noFramesAvailable
source: No frame data available
zh_hans: 没有可用帧数据
